#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.
x = 3
y = 4
a = (x+y)
print(a)
b = (x-y)
print(b)
c = (x*y)
print(c)
d = (x/y)
print(d)
e = (x//y)
print(e)
f = (x%y)
print(f)
g = (x**y)
print(g)


