#todo: Определить в коде  переменные:

1. Целочисленного типа
2. Вещественного типа
3. Логического типа
4. Строкового типа
5. Пустого типа


Вывести все их типы.

#1.Целочисленный
int(x=4)
print(x)
#2.Вещественный
float(x=2.55)
print(x)
#3.Логический
bool
flag = false
is_status = true
#4.Строковый
str
    (name="Маша")
print(name)
#5.Пустой
x=None
print(x)


